; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v1 ?v6)
		(pred_1 ?v8)
		(pred_3 ?v4)
		(pred_2 ?v4)
		(pred_6 ?v8 ?v4)
		(pred_4)
		(pred_5 ?v8))

   (:action op_2
       :parameters  (?v5 ?v3)
       :precondition (and (not-eq ?v5 ?v3) 
                          (pred_3 ?v5) (pred_3 ?v3) (pred_2 ?v5))
       :effect (and  (pred_2 ?v3)
		     (not (pred_2 ?v5))))


   (:action op_3
       :parameters (?v7 ?v2)
       :precondition  (and  (pred_1 ?v7) (pred_3 ?v2)
			    (pred_6 ?v7 ?v2) (pred_2 ?v2) (pred_4))
       :effect (and (pred_5 ?v7)
		    (not (pred_6 ?v7 ?v2)) 
		    (not (pred_4))))

   (:action op_1
       :parameters  (?v7  ?v2)
       :precondition  (and  (pred_1 ?v7) (pred_3 ?v2)
			    (pred_5 ?v7) (pred_2 ?v2))
       :effect (and (pred_6 ?v7 ?v2)
		    (pred_4)
		    (not (pred_5 ?v7)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_06 obj_01 obj_04 
          obj_02 obj_03 obj_05 
)
(:init
(pred_3 obj_06)
(pred_3 obj_01)
(pred_3 obj_04)
(pred_1 obj_02)
(pred_1 obj_03)
(pred_1 obj_05)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(pred_4)
(pred_6 obj_02 obj_06)
(pred_6 obj_03 obj_01)
(pred_6 obj_05 obj_06)
(pred_2 obj_06)
)
(:goal
(and
(pred_6 obj_02 obj_04)
(pred_6 obj_03 obj_01)
(pred_6 obj_05 obj_04)
)
)

(:constraints
  (and
    (sometime-before  (pred_6 obj_02 obj_04) (pred_2 obj_01))
    (sometime-before  (pred_6 obj_05 obj_04) (pred_2 obj_01))
  )
)
)

; plan
1. (op_3 obj_02 obj_06)
   deleted: (pred_6 obj_02 obj_06) (pred_4)
   added: (pred_5 obj_02)
   goals met: 1 of 3
2. (op_2 obj_06 obj_01)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_01)
   goals met: 1 of 3
3. (op_1 obj_02 obj_01)
   deleted: (pred_5 obj_02)
   added: (pred_6 obj_02 obj_01) (pred_4)
   goals met: 1 of 3
4. (op_2 obj_01 obj_06)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_06)
   goals met: 1 of 3
5. (op_3 obj_05 obj_06)
   deleted: (pred_6 obj_05 obj_06) (pred_4)
   added: (pred_5 obj_05)
   goals met: 1 of 3
6. (op_2 obj_06 obj_04)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_04)
   goals met: 1 of 3
7. (op_1 obj_05 obj_04)
   deleted: (pred_5 obj_05)
   added: (pred_6 obj_05 obj_04) (pred_4)
   goals met: 2 of 3
8. (op_2 obj_04 obj_01)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_01)
   goals met: 2 of 3
9. (op_3 obj_02 obj_01)
   deleted: (pred_6 obj_02 obj_01) (pred_4)
   added: (pred_5 obj_02)
   goals met: 2 of 3
10. (op_2 obj_01 obj_04)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_04)
   goals met: 2 of 3
11. (op_1 obj_02 obj_04)
   deleted: (pred_5 obj_02)
   added: (pred_6 obj_02 obj_04) (pred_4)
   goals met: 3 of 3
